// lab11(2)_Габестро.cpp.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

using namespace std;

int main() {
    setlocale(LC_CTYPE, "ukr");

    // Оголошення покажчиків на цілий тип
    int* ptr1, * ptr2;

    // Виділення динамічної пам'яті для покажчиків
    ptr1 = new int;
    ptr2 = new int;

    // Присвоєння довільних значень виділеним коміркам пам'яті
    *ptr1 = 10;
    *ptr2 = 20;

    // Вивід значень, які зберігаються у комірках пам'яті
    cout << "Значення, збережене в комірці пам'яті, на яку вказує ptr1: " << *ptr1 << endl;
    cout << "Значення, збережене в комірці пам'яті, на яку вказує ptr2: " << *ptr2 << endl;

    // Звільнення виділеної пам'яті
    delete ptr1;
    delete ptr2;

    return 0;
}